bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/dvp_tsrc_axi_reg.h
/*
 * Copyright (c) 2016-2022 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef  __DVP_TSRC_AXI_REG_H__
#define  __DVP_TSRC_AXI_REG_H__

/* 0x0 : config */
#define DVP_TSRC_AXI_CONFIG_OFFSET                              (0x0)
#define DVP_TSRC_AXI_CR_ENABLE_POS                              (0U)
#define DVP_TSRC_AXI_CR_ENABLE_LEN                              (1U)
#define DVP_TSRC_AXI_CR_ENABLE_MSK                              (((1U<<DVP_TSRC_AXI_CR_ENABLE_LEN)-1)<<DVP_TSRC_AXI_CR_ENABLE_POS)
#define DVP_TSRC_AXI_CR_ENABLE_UMSK                             (~(((1U<<DVP_TSRC_AXI_CR_ENABLE_LEN)-1)<<DVP_TSRC_AXI_CR_ENABLE_POS))
#define DVP_TSRC_AXI_CR_ENABLE_SET                              (1U<<DVP_TSRC_AXI_CR_ENABLE_POS)
#define DVP_TSRC_AXI_CR_ENABLE_CLEAR                            (~(((1U<<DVP_TSRC_AXI_CR_ENABLE_LEN)-1)<<DVP_TSRC_AXI_CR_ENABLE_POS))
#define DVP_TSRC_AXI_CR_AXI2DVP_EN_POS                          (1U)
#define DVP_TSRC_AXI_CR_AXI2DVP_EN_LEN                          (1U)
#define DVP_TSRC_AXI_CR_AXI2DVP_EN_MSK                          (((1U<<DVP_TSRC_AXI_CR_AXI2DVP_EN_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_EN_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_EN_UMSK                         (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_EN_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_EN_POS))
#define DVP_TSRC_AXI_CR_AXI2DVP_EN_SET                          (1U<<DVP_TSRC_AXI_CR_AXI2DVP_EN_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_EN_CLEAR                        (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_EN_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_EN_POS))
#define DVP_TSRC_AXI_CR_MODE_CEA_861_POS                        (2U)
#define DVP_TSRC_AXI_CR_MODE_CEA_861_LEN                        (1U)
#define DVP_TSRC_AXI_CR_MODE_CEA_861_MSK                        (((1U<<DVP_TSRC_AXI_CR_MODE_CEA_861_LEN)-1)<<DVP_TSRC_AXI_CR_MODE_CEA_861_POS)
#define DVP_TSRC_AXI_CR_MODE_CEA_861_UMSK                       (~(((1U<<DVP_TSRC_AXI_CR_MODE_CEA_861_LEN)-1)<<DVP_TSRC_AXI_CR_MODE_CEA_861_POS))
#define DVP_TSRC_AXI_CR_MODE_CEA_861_SET                        (1U<<DVP_TSRC_AXI_CR_MODE_CEA_861_POS)
#define DVP_TSRC_AXI_CR_MODE_CEA_861_CLEAR                      (~(((1U<<DVP_TSRC_AXI_CR_MODE_CEA_861_LEN)-1)<<DVP_TSRC_AXI_CR_MODE_CEA_861_POS))
#define DVP_TSRC_AXI_CR_SNSR_EN_POS                             (3U)
#define DVP_TSRC_AXI_CR_SNSR_EN_LEN                             (1U)
#define DVP_TSRC_AXI_CR_SNSR_EN_MSK                             (((1U<<DVP_TSRC_AXI_CR_SNSR_EN_LEN)-1)<<DVP_TSRC_AXI_CR_SNSR_EN_POS)
#define DVP_TSRC_AXI_CR_SNSR_EN_UMSK                            (~(((1U<<DVP_TSRC_AXI_CR_SNSR_EN_LEN)-1)<<DVP_TSRC_AXI_CR_SNSR_EN_POS))
#define DVP_TSRC_AXI_CR_SNSR_EN_SET                             (1U<<DVP_TSRC_AXI_CR_SNSR_EN_POS)
#define DVP_TSRC_AXI_CR_SNSR_EN_CLEAR                           (~(((1U<<DVP_TSRC_AXI_CR_SNSR_EN_LEN)-1)<<DVP_TSRC_AXI_CR_SNSR_EN_POS))
#define DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_POS                      (4U)
#define DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_LEN                      (1U)
#define DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_MSK                      (((1U<<DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_LEN)-1)<<DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_POS)
#define DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_UMSK                     (~(((1U<<DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_LEN)-1)<<DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_POS))
#define DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_SET                      (1U<<DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_POS)
#define DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_CLEAR                    (~(((1U<<DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_LEN)-1)<<DVP_TSRC_AXI_CR_SNSR_HSYNC_INV_POS))
#define DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_POS                      (5U)
#define DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_LEN                      (1U)
#define DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_MSK                      (((1U<<DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_LEN)-1)<<DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_POS)
#define DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_UMSK                     (~(((1U<<DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_LEN)-1)<<DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_POS))
#define DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_SET                      (1U<<DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_POS)
#define DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_CLEAR                    (~(((1U<<DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_LEN)-1)<<DVP_TSRC_AXI_CR_SNSR_VSYNC_INV_POS))
#define DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_POS                   (6U)
#define DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_LEN                   (1U)
#define DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_MSK                   (((1U<<DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_UMSK                  (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_POS))
#define DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_SET                   (1U<<DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_CLEAR                 (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_8BIT_MODE_POS))
#define DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_POS                   (7U)
#define DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_LEN                   (1U)
#define DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_MSK                   (((1U<<DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_UMSK                  (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_POS))
#define DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_SET                   (1U<<DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_CLEAR                 (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_SWAP_MODE_POS))
#define DVP_TSRC_AXI_CR_AXI2DVP_SWAP_IDX_SEL_POS                (8U)
#define DVP_TSRC_AXI_CR_AXI2DVP_SWAP_IDX_SEL_LEN                (2U)
#define DVP_TSRC_AXI_CR_AXI2DVP_SWAP_IDX_SEL_MSK                (((1U<<DVP_TSRC_AXI_CR_AXI2DVP_SWAP_IDX_SEL_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_SWAP_IDX_SEL_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_SWAP_IDX_SEL_UMSK               (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_SWAP_IDX_SEL_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_SWAP_IDX_SEL_POS))

/* 0x4 : frame_size_h */
#define DVP_TSRC_AXI_FRAME_SIZE_H_OFFSET                        (0x4)
#define DVP_TSRC_AXI_CR_TOTAL_H_POS                             (0U)
#define DVP_TSRC_AXI_CR_TOTAL_H_LEN                             (12U)
#define DVP_TSRC_AXI_CR_TOTAL_H_MSK                             (((1U<<DVP_TSRC_AXI_CR_TOTAL_H_LEN)-1)<<DVP_TSRC_AXI_CR_TOTAL_H_POS)
#define DVP_TSRC_AXI_CR_TOTAL_H_UMSK                            (~(((1U<<DVP_TSRC_AXI_CR_TOTAL_H_LEN)-1)<<DVP_TSRC_AXI_CR_TOTAL_H_POS))
#define DVP_TSRC_AXI_CR_BLANK_H_POS                             (16U)
#define DVP_TSRC_AXI_CR_BLANK_H_LEN                             (12U)
#define DVP_TSRC_AXI_CR_BLANK_H_MSK                             (((1U<<DVP_TSRC_AXI_CR_BLANK_H_LEN)-1)<<DVP_TSRC_AXI_CR_BLANK_H_POS)
#define DVP_TSRC_AXI_CR_BLANK_H_UMSK                            (~(((1U<<DVP_TSRC_AXI_CR_BLANK_H_LEN)-1)<<DVP_TSRC_AXI_CR_BLANK_H_POS))

/* 0x8 : frame_size_v */
#define DVP_TSRC_AXI_FRAME_SIZE_V_OFFSET                        (0x8)
#define DVP_TSRC_AXI_CR_TOTAL_V_POS                             (0U)
#define DVP_TSRC_AXI_CR_TOTAL_V_LEN                             (12U)
#define DVP_TSRC_AXI_CR_TOTAL_V_MSK                             (((1U<<DVP_TSRC_AXI_CR_TOTAL_V_LEN)-1)<<DVP_TSRC_AXI_CR_TOTAL_V_POS)
#define DVP_TSRC_AXI_CR_TOTAL_V_UMSK                            (~(((1U<<DVP_TSRC_AXI_CR_TOTAL_V_LEN)-1)<<DVP_TSRC_AXI_CR_TOTAL_V_POS))
#define DVP_TSRC_AXI_CR_BLANK_V_POS                             (16U)
#define DVP_TSRC_AXI_CR_BLANK_V_LEN                             (12U)
#define DVP_TSRC_AXI_CR_BLANK_V_MSK                             (((1U<<DVP_TSRC_AXI_CR_BLANK_V_LEN)-1)<<DVP_TSRC_AXI_CR_BLANK_V_POS)
#define DVP_TSRC_AXI_CR_BLANK_V_UMSK                            (~(((1U<<DVP_TSRC_AXI_CR_BLANK_V_LEN)-1)<<DVP_TSRC_AXI_CR_BLANK_V_POS))

