bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/dvp_tsrc_axi_reg.h
/* 0xC : frame_size_cea_861 */
#define DVP_TSRC_AXI_FRAME_SIZE_CEA_861_OFFSET                  (0xC)
#define DVP_TSRC_AXI_CR_H_DURATION_POS                          (0U)
#define DVP_TSRC_AXI_CR_H_DURATION_LEN                          (8U)
#define DVP_TSRC_AXI_CR_H_DURATION_MSK                          (((1U<<DVP_TSRC_AXI_CR_H_DURATION_LEN)-1)<<DVP_TSRC_AXI_CR_H_DURATION_POS)
#define DVP_TSRC_AXI_CR_H_DURATION_UMSK                         (~(((1U<<DVP_TSRC_AXI_CR_H_DURATION_LEN)-1)<<DVP_TSRC_AXI_CR_H_DURATION_POS))
#define DVP_TSRC_AXI_CR_H_PLACEMENT_POS                         (8U)
#define DVP_TSRC_AXI_CR_H_PLACEMENT_LEN                         (8U)
#define DVP_TSRC_AXI_CR_H_PLACEMENT_MSK                         (((1U<<DVP_TSRC_AXI_CR_H_PLACEMENT_LEN)-1)<<DVP_TSRC_AXI_CR_H_PLACEMENT_POS)
#define DVP_TSRC_AXI_CR_H_PLACEMENT_UMSK                        (~(((1U<<DVP_TSRC_AXI_CR_H_PLACEMENT_LEN)-1)<<DVP_TSRC_AXI_CR_H_PLACEMENT_POS))
#define DVP_TSRC_AXI_CR_V_DURATION_POS                          (16U)
#define DVP_TSRC_AXI_CR_V_DURATION_LEN                          (8U)
#define DVP_TSRC_AXI_CR_V_DURATION_MSK                          (((1U<<DVP_TSRC_AXI_CR_V_DURATION_LEN)-1)<<DVP_TSRC_AXI_CR_V_DURATION_POS)
#define DVP_TSRC_AXI_CR_V_DURATION_UMSK                         (~(((1U<<DVP_TSRC_AXI_CR_V_DURATION_LEN)-1)<<DVP_TSRC_AXI_CR_V_DURATION_POS))
#define DVP_TSRC_AXI_CR_V_PLACEMENT_POS                         (24U)
#define DVP_TSRC_AXI_CR_V_PLACEMENT_LEN                         (8U)
#define DVP_TSRC_AXI_CR_V_PLACEMENT_MSK                         (((1U<<DVP_TSRC_AXI_CR_V_PLACEMENT_LEN)-1)<<DVP_TSRC_AXI_CR_V_PLACEMENT_POS)
#define DVP_TSRC_AXI_CR_V_PLACEMENT_UMSK                        (~(((1U<<DVP_TSRC_AXI_CR_V_PLACEMENT_LEN)-1)<<DVP_TSRC_AXI_CR_V_PLACEMENT_POS))

/* 0x10 : pix_data_range */
#define DVP_TSRC_AXI_PIX_DATA_RANGE_OFFSET                      (0x10)
#define DVP_TSRC_AXI_CR_DATA_MIN_POS                            (0U)
#define DVP_TSRC_AXI_CR_DATA_MIN_LEN                            (16U)
#define DVP_TSRC_AXI_CR_DATA_MIN_MSK                            (((1U<<DVP_TSRC_AXI_CR_DATA_MIN_LEN)-1)<<DVP_TSRC_AXI_CR_DATA_MIN_POS)
#define DVP_TSRC_AXI_CR_DATA_MIN_UMSK                           (~(((1U<<DVP_TSRC_AXI_CR_DATA_MIN_LEN)-1)<<DVP_TSRC_AXI_CR_DATA_MIN_POS))
#define DVP_TSRC_AXI_CR_DATA_MAX_POS                            (16U)
#define DVP_TSRC_AXI_CR_DATA_MAX_LEN                            (16U)
#define DVP_TSRC_AXI_CR_DATA_MAX_MSK                            (((1U<<DVP_TSRC_AXI_CR_DATA_MAX_LEN)-1)<<DVP_TSRC_AXI_CR_DATA_MAX_POS)
#define DVP_TSRC_AXI_CR_DATA_MAX_UMSK                           (~(((1U<<DVP_TSRC_AXI_CR_DATA_MAX_LEN)-1)<<DVP_TSRC_AXI_CR_DATA_MAX_POS))

/* 0x14 : pix_data_step */
#define DVP_TSRC_AXI_PIX_DATA_STEP_OFFSET                       (0x14)
#define DVP_TSRC_AXI_CR_DATA_STEP_POS                           (0U)
#define DVP_TSRC_AXI_CR_DATA_STEP_LEN                           (8U)
#define DVP_TSRC_AXI_CR_DATA_STEP_MSK                           (((1U<<DVP_TSRC_AXI_CR_DATA_STEP_LEN)-1)<<DVP_TSRC_AXI_CR_DATA_STEP_POS)
#define DVP_TSRC_AXI_CR_DATA_STEP_UMSK                          (~(((1U<<DVP_TSRC_AXI_CR_DATA_STEP_LEN)-1)<<DVP_TSRC_AXI_CR_DATA_STEP_POS))

/* 0x20 : axi2dvp_setting */
#define DVP_TSRC_AXI_AXI2DVP_SETTING_OFFSET                     (0x20)
#define DVP_TSRC_AXI_CR_AXI2DVP_XLEN_POS                        (0U)
#define DVP_TSRC_AXI_CR_AXI2DVP_XLEN_LEN                        (3U)
#define DVP_TSRC_AXI_CR_AXI2DVP_XLEN_MSK                        (((1U<<DVP_TSRC_AXI_CR_AXI2DVP_XLEN_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_XLEN_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_XLEN_UMSK                       (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_XLEN_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_XLEN_POS))
#define DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_POS               (4U)
#define DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_LEN               (1U)
#define DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_MSK               (((1U<<DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_UMSK              (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_POS))
#define DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_SET               (1U<<DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_CLEAR             (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_DRAIN_ERR_CLR_POS))

/* 0x24 : axi2dvp_start_addr */
#define DVP_TSRC_AXI_AXI2DVP_START_ADDR_OFFSET                  (0x24)
#define DVP_TSRC_AXI_CR_AXI2DVP_ADDR_START_POS                  (0U)
#define DVP_TSRC_AXI_CR_AXI2DVP_ADDR_START_LEN                  (32U)
#define DVP_TSRC_AXI_CR_AXI2DVP_ADDR_START_MSK                  (((1U<<DVP_TSRC_AXI_CR_AXI2DVP_ADDR_START_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_ADDR_START_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_ADDR_START_UMSK                 (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_ADDR_START_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_ADDR_START_POS))

/* 0x28 : axi2dvp_burst_cnt */
#define DVP_TSRC_AXI_AXI2DVP_BURST_CNT_OFFSET                   (0x28)
#define DVP_TSRC_AXI_CR_AXI2DVP_FRAME_BURST_CNT_POS             (0U)
#define DVP_TSRC_AXI_CR_AXI2DVP_FRAME_BURST_CNT_LEN             (32U)
#define DVP_TSRC_AXI_CR_AXI2DVP_FRAME_BURST_CNT_MSK             (((1U<<DVP_TSRC_AXI_CR_AXI2DVP_FRAME_BURST_CNT_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_FRAME_BURST_CNT_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_FRAME_BURST_CNT_UMSK            (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_FRAME_BURST_CNT_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_FRAME_BURST_CNT_POS))

/* 0x2C : axi2dvp_status */
#define DVP_TSRC_AXI_AXI2DVP_STATUS_OFFSET                      (0x2C)
#define DVP_TSRC_AXI_ST_AXI2DVP_FIFO_CNT_POS                    (0U)
#define DVP_TSRC_AXI_ST_AXI2DVP_FIFO_CNT_LEN                    (7U)
#define DVP_TSRC_AXI_ST_AXI2DVP_FIFO_CNT_MSK                    (((1U<<DVP_TSRC_AXI_ST_AXI2DVP_FIFO_CNT_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_FIFO_CNT_POS)
#define DVP_TSRC_AXI_ST_AXI2DVP_FIFO_CNT_UMSK                   (~(((1U<<DVP_TSRC_AXI_ST_AXI2DVP_FIFO_CNT_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_FIFO_CNT_POS))
#define DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_POS                 (7U)
#define DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_LEN                 (1U)
#define DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_MSK                 (((1U<<DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_POS)
#define DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_UMSK                (~(((1U<<DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_POS))
#define DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_SET                 (1U<<DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_POS)
#define DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_CLEAR               (~(((1U<<DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_DRAIN_ERROR_POS))
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_POS                  (8U)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_LEN                  (1U)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_MSK                  (((1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_POS)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_UMSK                 (~(((1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_POS))
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_SET                  (1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_POS)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_CLEAR                (~(((1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_IDLE_POS))
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_POS                  (9U)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_LEN                  (1U)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_MSK                  (((1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_POS)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_UMSK                 (~(((1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_POS))
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_SET                  (1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_POS)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_CLEAR                (~(((1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FUNC_POS))
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_POS                  (10U)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_LEN                  (1U)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_MSK                  (((1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_POS)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_UMSK                 (~(((1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_POS))
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_SET                  (1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_POS)
#define DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_CLEAR                (~(((1U<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_LEN)-1)<<DVP_TSRC_AXI_ST_AXI2DVP_STATE_FLSH_POS))

/* 0x30 : axi2dvp_swap_addr */
#define DVP_TSRC_AXI_AXI2DVP_SWAP_ADDR_OFFSET                   (0x30)
#define DVP_TSRC_AXI_CR_AXI2DVP_ADDR_SWAP_POS                   (0U)
#define DVP_TSRC_AXI_CR_AXI2DVP_ADDR_SWAP_LEN                   (32U)
#define DVP_TSRC_AXI_CR_AXI2DVP_ADDR_SWAP_MSK                   (((1U<<DVP_TSRC_AXI_CR_AXI2DVP_ADDR_SWAP_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_ADDR_SWAP_POS)
#define DVP_TSRC_AXI_CR_AXI2DVP_ADDR_SWAP_UMSK                  (~(((1U<<DVP_TSRC_AXI_CR_AXI2DVP_ADDR_SWAP_LEN)-1)<<DVP_TSRC_AXI_CR_AXI2DVP_ADDR_SWAP_POS))

/* 0x34 : axi2dvp_prefetch */
#define DVP_TSRC_AXI_AXI2DVP_PREFETCH_OFFSET                    (0x34)
#define DVP_TSRC_AXI_CR_PREFETCH_V_POS                          (0U)
#define DVP_TSRC_AXI_CR_PREFETCH_V_LEN                          (12U)
#define DVP_TSRC_AXI_CR_PREFETCH_V_MSK                          (((1U<<DVP_TSRC_AXI_CR_PREFETCH_V_LEN)-1)<<DVP_TSRC_AXI_CR_PREFETCH_V_POS)
#define DVP_TSRC_AXI_CR_PREFETCH_V_UMSK                         (~(((1U<<DVP_TSRC_AXI_CR_PREFETCH_V_LEN)-1)<<DVP_TSRC_AXI_CR_PREFETCH_V_POS))

/* 0x38 : snsr2dvp_wait_pos */
#define DVP_TSRC_AXI_SNSR2DVP_WAIT_POS_OFFSET                   (0x38)
#define DVP_TSRC_AXI_CR_SNSR_FIFO_TH_POS                        (0U)
#define DVP_TSRC_AXI_CR_SNSR_FIFO_TH_LEN                        (12U)
#define DVP_TSRC_AXI_CR_SNSR_FIFO_TH_MSK                        (((1U<<DVP_TSRC_AXI_CR_SNSR_FIFO_TH_LEN)-1)<<DVP_TSRC_AXI_CR_SNSR_FIFO_TH_POS)
#define DVP_TSRC_AXI_CR_SNSR_FIFO_TH_UMSK                       (~(((1U<<DVP_TSRC_AXI_CR_SNSR_FIFO_TH_LEN)-1)<<DVP_TSRC_AXI_CR_SNSR_FIFO_TH_POS))


