bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/mm_reg/dvp_tsrc_axi_reg.h
struct  dvp_tsrc_axi_reg {
    /* 0x0 : config */
    union {
        struct {
            uint32_t cr_enable                      :  1; /* [    0],        r/w,        0x0 */
            uint32_t cr_axi2dvp_en                  :  1; /* [    1],        r/w,        0x0 */
            uint32_t cr_mode_cea_861                :  1; /* [    2],        r/w,        0x0 */
            uint32_t cr_snsr_en                     :  1; /* [    3],        r/w,        0x0 */
            uint32_t cr_snsr_hsync_inv              :  1; /* [    4],        r/w,        0x0 */
            uint32_t cr_snsr_vsync_inv              :  1; /* [    5],        r/w,        0x0 */
            uint32_t cr_axi2dvp_8bit_mode           :  1; /* [    6],        r/w,        0x0 */
            uint32_t cr_axi2dvp_swap_mode           :  1; /* [    7],        r/w,        0x0 */
            uint32_t cr_axi2dvp_swap_idx_sel        :  2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_31                 : 22; /* [31:10],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } config;

    /* 0x4 : frame_size_h */
    union {
        struct {
            uint32_t cr_total_h                     : 12; /* [11: 0],        r/w,      0x897 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t cr_blank_h                     : 12; /* [27:16],        r/w,      0x117 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } frame_size_h;

    /* 0x8 : frame_size_v */
    union {
        struct {
            uint32_t cr_total_v                     : 12; /* [11: 0],        r/w,      0x464 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t cr_blank_v                     : 12; /* [27:16],        r/w,       0x2c */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } frame_size_v;

    /* 0xC : frame_size_cea_861 */
    union {
        struct {
            uint32_t cr_h_duration                  :  8; /* [ 7: 0],        r/w,       0x83 */
            uint32_t cr_h_placement                 :  8; /* [15: 8],        r/w,       0x57 */
            uint32_t cr_v_duration                  :  8; /* [23:16],        r/w,        0x8 */
            uint32_t cr_v_placement                 :  8; /* [31:24],        r/w,        0x3 */
        }BF;
        uint32_t WORD;
    } frame_size_cea_861;

    /* 0x10 : pix_data_range */
    union {
        struct {
            uint32_t cr_data_min                    : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t cr_data_max                    : 16; /* [31:16],        r/w,     0xffff */
        }BF;
        uint32_t WORD;
    } pix_data_range;

    /* 0x14 : pix_data_step */
    union {
        struct {
            uint32_t cr_data_step                   :  8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t reserved_8_31                  : 24; /* [31: 8],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pix_data_step;

    /* 0x18  reserved */
    uint8_t RESERVED0x18[8];

    /* 0x20 : axi2dvp_setting */
    union {
        struct {
            uint32_t cr_axi2dvp_xlen                :  3; /* [ 2: 0],        r/w,        0x3 */
            uint32_t reserved_3                     :  1; /* [    3],       rsvd,        0x0 */
            uint32_t cr_axi2dvp_drain_err_clr       :  1; /* [    4],        w1p,        0x0 */
            uint32_t reserved_5_31                  : 27; /* [31: 5],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } axi2dvp_setting;

    /* 0x24 : axi2dvp_start_addr */
    union {
        struct {
            uint32_t cr_axi2dvp_addr_start          : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } axi2dvp_start_addr;

    /* 0x28 : axi2dvp_burst_cnt */
    union {
        struct {
            uint32_t cr_axi2dvp_frame_burst_cnt     : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } axi2dvp_burst_cnt;

    /* 0x2C : axi2dvp_status */
    union {
        struct {
            uint32_t st_axi2dvp_fifo_cnt            :  7; /* [ 6: 0],          r,        0x0 */
            uint32_t st_axi2dvp_drain_error         :  1; /* [    7],          r,        0x0 */
            uint32_t st_axi2dvp_state_idle          :  1; /* [    8],          r,        0x0 */
            uint32_t st_axi2dvp_state_func          :  1; /* [    9],          r,        0x0 */
            uint32_t st_axi2dvp_state_flsh          :  1; /* [   10],          r,        0x0 */
            uint32_t reserved_11_31                 : 21; /* [31:11],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } axi2dvp_status;

    /* 0x30 : axi2dvp_swap_addr */
    union {
        struct {
            uint32_t cr_axi2dvp_addr_swap           : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } axi2dvp_swap_addr;

    /* 0x34 : axi2dvp_prefetch */
    union {
        struct {
            uint32_t cr_prefetch_v                  : 12; /* [11: 0],        r/w,       0x28 */
            uint32_t reserved_12_31                 : 20; /* [31:12],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } axi2dvp_prefetch;

    /* 0x38 : snsr2dvp_wait_pos */
    union {
        struct {
            uint32_t cr_snsr_fifo_th                : 12; /* [11: 0],        r/w,       0x8b */
            uint32_t reserved_12_31                 : 20; /* [31:12],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } snsr2dvp_wait_pos;

};

typedef volatile struct dvp_tsrc_axi_reg dvp_tsrc_axi_reg_t;


#endif  /* __DVP_TSRC_AXI_REG_H__ */
